Repository: vchib1/QR-Scanner
Catalog: lib/l10n/app_*.arb
Languages: ta, te, ur

source: OK
ta: சரி
te: సరే
ur: ٹھیک ہے

source: Cancel
ta: ரத்து செய்
te: రద్దు
ur: منسوخ کریں

source: Close
ta: மூடு
te: మూసివేయి
ur: بند کریں

source: Open
ta: திற
te: తెరువు
ur: کھولیں

source: Proceed
ta: தொடர்
te: కొనసాగించు
ur: جاری رکھیں

source: Share
ta: பகிர்
te: పంచుకో
ur: شیئر کریں

source: Copy
ta: நகல் எடு
te: కాపీ చేయి
ur: نقل کریں

source: Copied
ta: நகலெடுக்கப்பட்டது
te: కాపీ అయ్యింది
ur: نقل ہو گیا

source: Delete
ta: அழி
te: తొలగించు
ur: حذف کریں

source: Delete Item
ta: பொருளை அழி
te: అంశాన్ని తొలగించు
ur: آئٹم حذف کریں

# deleteItemConfirm
source: Are you sure you want to delete this item?
ta: இந்தப் பொருளை அழிக்க உறுதியாக இருக்கிறீர்களா?
te: ఈ అంశాన్ని మీరు ఖచ్చితంగా తొలగించాలనుకుంటున్నారా?
ur: کیا آپ واقعی اس آئٹم کو حذف کرنا چاہتے ہیں؟

source: Confirm
ta: உறுதிப்படுத்து
te: నిర్ధారించు
ur: تصدیق کریں

source: Next
ta: அடுத்தது
te: తర్వాత
ur: اگلا

source: pick from gallery
ta: கேலரியிலிருந்து தேர்ந்தெடுக்கவும்
te: గ్యాలరీ నుండి ఎంచుకోండి
ur: گیلری سے منتخب کریں

source: System
ta: அமைப்பு
te: సిస్టమ్
ur: سسٹم

source: Light
ta: வெளிச்சம்
te: లైట్
ur: ہلکا

source: Dark
ta: இருள்
te: డార్క్
ur: تاریک

source: Low
ta: குறைந்த
te: తక్కువ
ur: کم

source: Medium
ta: நடுத்தர
te: మధ్యమం
ur: درمیانہ

source: High
ta: உயர்ந்த
te: అధికం
ur: زیادہ

source: App
ta: பயன்பாடு
te: యాప్
ur: ایپ

source: Today
ta: இன்று
te: ఈ రోజు

source: Yesterday
ta: நேற்று
te: నిన్న

source: Home
ta: முகப்பு
te: హోమ్
ur: ہوم

source: History
ta: வரலாறு
te: చరిత్ర
ur: تاریخ

source: No History
ta: வரலாறு இல்லை
te: చరిత్ర లేదు
ur: کوئی تاریخ نہیں

source: Settings
ta: அமைப்புகள்
te: సెట్టింగ్స్
ur: ترتیبات

# scanQRCodeTitle
source: Scan QR Code
ta: QR குறியீட்டைச் சுட்டி
te: QR కోడ్ స్కాన్ చేయండి
ur: کیو آر کوڈ اسکین کریں

# scanQRCodeSubtitle
source: Scan QR using device camera.
ta: சாதனத்தின் புகைப்படக் கருவியைப் பயன்படுத்தி QR குறியீட்டைச் சுட்டி.
te: QR కోడ్‌ను స్కాన్ చేయడానికి కెమెరాను ఉపయోగించండి.
ur: ڈیوائس کیمرہ استعمال کر کے کیو آر اسکین کریں۔

# scanImageTitle
source: Scan Image
ta: படத்தைச் சுட்டி
te: చిత్రాన్ని స్కాన్ చేయండి
ur: تصویر اسکین کریں

# scanImageSubtitle
source: Find QR Codes from an image.
ta: ஒரு படத்தில் QR குறியீடுகளைத் தேடு.
te: చిత్రం నుండి QR కోడ్‌ను గుర్తించండి.
ur: تصویر میں سے کیو آر کوڈ تلاش کریں۔

# qrGeneratorTitle
source: QR Generator
ta: QR குறியீட்டு உருவாக்கி
te: QR జనరేటర్
ur: کیو آر جنریٹر

# qrGeneratorSubtitle
source: Create your own QR Code.
ta: உங்கள் சொந்த QR குறியீட்டை உருவாக்கு.
te: మీ స్వంత QR కోడ్‌ను సృష్టించండి.
ur: اپنا خود کا کیو آر کوڈ بنائیں۔

source: Text
ta: வரி
te: పాఠ్యం
ur: متن

source: Mail
ta: மின்னஞ்சல்
te: మెయిల్
ur: ای میل

source: To
ta: அனுப்புவதற்கு
te: వెళ్లడానికి
ur: موصول کنندہ

source: Subject
ta: தலைப்பு
te: విషయం
ur: عنوان

source: Body
ta: உள்ளடக்கம்
te: శరీరం
ur: پیغام

source: Url
ta: இணைப்பு
te: లింక్
ur: لنک

# urlError
source: Please enter a valid URL.
ta: தயவுசெய்து செல்லுபடியாகும் ஒரு URL ஐ உள்ளிடவும்.
te: దయచేసి సరైన వెబ్ లింక్‌ను నమోదు చేయండి.
ur: براہ کرم درست یو آر ایل درج کریں۔

source: Phone
ta: தொலைபேசி
te: ఫోన్
ur: فون

source: Message
ta: செய்தி
te: సందేశం
ur: پیغام

source: Sms
ta: சுருக்கச் செய்தி
ur: ایس ایم ایس

source: QR Editor
ta: QR குறியீட்டு ஆசிரியர்
te: QR ఎడిటర్
ur: کیو آر ایڈیٹر

# bgColorTitle
source: Background Color
ta: பின்னணி வண்ணம்
te: బ్యాక్‌గ్రౌండ్ రంగు
ur: پس منظر کا رنگ

# bgColorSubtitle
source: Pick a color that contrasts with the pattern to ensure clear scanning.
ta: தெளிவான ஸ்கேனிங்குக்காக வடிவத்துடன் முரண்படும் வண்ணத்தைத் தேர்ந்தெடுக்கவும்.
te: స్కాన్ చేయడానికి విరుద్ధ రంగును ఎంచుకోండి.
ur: ایک ایسا رنگ منتخب کریں جو پیٹرن کے ساتھ تضاد رکھے تاکہ اسکین واضح ہو۔

# patternColorTitle
source: Pattern Color
ta: வடிவ வண்ணம்
te: ప్యాటర్న్ రంగు
ur: پیٹرن کا رنگ

# patternColorSubtitle
source: Pick color for pattern (dots). Use a dark color for clear scanning.
ta: வடிவத்திற்கு (புள்ளிகள்) வண்ணத்தைத் தேர்ந்தெடுக்கவும். தெளிவான ஸ்கேனிங்குக்காக இருண்ட வண்ணத்தைப் பயன்படுத்தவும்.
te: డాట్స్‌కి రంగును ఎంచుకోండి. డార్క్ కలర్‌లు మంచి స్కానింగ్‌కు ఉపకరిస్తాయి.
ur: پیٹرن (ڈاٹس) کے لیے رنگ منتخب کریں۔ واضح اسکین کے لیے گہرا رنگ استعمال کریں۔

# eyeColorTitle
source: Eye Color
ta: கண் வண்ணம்
te: ఐ రంగు
ur: آنکھ کا رنگ

# eyeColorSubtitle
source: Pick a color for the QR eye pattern (corner markers).
ta: QR குறியீட்டின் மூலைக் குறிகளுக்கு (கண்) வண்ணத்தைத் தேர்ந்தெடுக்கவும்.
te: QR కోడ్ మూలల్లో ఉన్న కన్నులకు రంగును ఎంచుకోండి.
ur: کیو آر کے کونے کے نشانات کے لیے رنگ منتخب کریں۔

# pickLogoTitle
source: Pick Logo
ta: லோகோவைத் தேர்ந்தெடுக்கவும்
ur: لوگو منتخب کریں

# pickLogoSubtitle
source: Add your custom logo in the center of the QR.
ta: QR குறியீட்டின் நடுவில் உங்கள் சொந்த லோகோவைச் சேர்க்கவும்.
ur: اپنا مخصوص لوگو کیو آر کے درمیان میں شامل کریں۔

# pickLogoWarning
source: Adding a logo could cause readability issues on scan.
ta: லோகோ சேர்ப்பதால் ஸ்கேனிங்கின் போது படிக்க சிரமமாக இருக்கலாம்.
ur: لوگو شامل کرنے سے اسکین کرنے میں دشواری ہو سکتی ہے۔

# pickLogoInvalidError
source: Please pick a valid logo.
ta: தயவுசெய்து செல்லுபடியாகும் லோகோவைத் தேர்ந்தெடுக்கவும்.
ur: براہ کرم درست لوگو منتخب کریں۔

# exportSizeTitle
source: Export Size
ta: ஏற்றுமதி அளவு
te: ఎగుమతి పరిమాణం
ur: ایکسپورٹ سائز

# exportSizeSubtitle
source: Larger size provides better quality.
ta: பெரிய அளவு சிறந்த தரத்தை வழங்குகிறது.
te: హై క్వాలిటీ కోసం పెద్ద పరిమాణం ఉత్తమం.
ur: بڑا سائز بہتر کوالٹی فراہم کرتا ہے۔

# enableGapTitle
source: Enable Gap
ta: இடைவெளியை இயக்கு
te: గ్యాప్ ప్రారంభించండి
ur: فاصلہ فعال کریں

# enableGapSubtitle
source: Allows the pattern to have some gap between.
ta: வடிவத்திற்கு இடையில் இடைவெளியை அனுமதிக்கவும்.
te: డాట్స్ మధ్య ఖాళీని జోడించండి.
ur: پیٹرن میں کچھ فاصلہ شامل کرنے کی اجازت دیتا ہے۔

source: Pattern Shape
ta: வடிவ வடிவம்
te: ప్యాటర్న్ ఆకారం
ur: پیٹرن کی شکل

source: Eye Shape
ta: கண் வடிவம்
te: ఐ ఆకారం
ur: آنکھ کی شکل

source: Square
ta: சதுரம்
te: చతురస్రం
ur: چوکور

source: Circle
ta: வட்டம்
te: వృత్తం
ur: گول

source: Save QR
ta: QR ஐ சேமிக்கவும்
te: QR సేవ్ చేయండి
ur: کیو آر محفوظ کریں

source: Share QR
ta: QR ஐ பகிர்க
te: QR పంచుకోండి
ur: کیو آر شیئر کریں

source: QR Saved
ta: QR சேமிக்கப்பட்டது
te: QR సేవ్ చేయబడింది
ur: کیو آر محفوظ ہو گیا

# imageNotExists
source: Image does not exist.
ta: படம் இல்லை.
te: చిత్రం లేదు.
ur: تصویر موجود نہیں ہے۔

# imagePickFailed
source: Failed to pick image
ta: படத்தைத் தேர்ந்தெடுப்பதில் தோல்வி
te: చిత్రాన్ని ఎంచుకోవడంలో విఫలమైంది.
ur: تصویر منتخب کرنے میں ناکامی

source: No QR Found.
ta: QR குறியீடு காணப்படவில்லை.
te: QR కోడ్ కనబడలేదు.
ur: کوئی کیو آر نہیں ملا۔

# themeTitle
source: Theme
ta: தீம்
te: థీమ్
ur: تھیم

# themeSubtitle
source: Theme Mode
ta: தீம் வகை
te: థీమ్ మోడ్
ur: تھیم موڈ

# contrastTitle
source: Contrast
ta: எதிரொளி
te: కాంట్రాస్ట్
ur: تضاد

# contrastSubtitle
source: Theme Contrast
ta: தீமின் எதிரொளி
te: థీమ్ కాంట్రాస్ట్ స్థాయి
ur: تھیم تضاد

# languageTitle
source: Language
ta: மொழி
te: భాష
ur: زبان

# languageSubtitle
source: Choose your preferred language
ta: உங்கள் விருப்பமான மொழியைத் தேர்ந்தெடுக்கவும்
te: మీకు ఇష్టమైన భాషను ఎంచుకోండి
ur: اپنی پسندیدہ زبان منتخب کریں

source: Data
ta: தரவு
te: డేటా
ur: ڈیٹا

# backupDataTitle
source: Backup Data
ta: தரவுகளை நகலெடுக்கவும்
te: డేటా బ్యాకప్
ur: ڈیٹا کا بیک اپ

# backupDataSubtitle
source: Create a backup file in your device.
ta: உங்கள் சாதனத்தில் நகலெடுக்கப்பட்ட கோப்பை உருவாக்கவும்.
te: మీ డివైస్‌లో బ్యాకప్ ఫైల్‌ని తయారు చేయండి.
ur: اپنے آلے میں بیک اپ فائل بنائیں۔

# restoreDataTitle
source: Restore Data
ta: தரவுகளை மீட்டெடுக்கவும்
te: డేటా రీస్టోర్ చేయండి
ur: ڈیٹا بحال کریں

# restoreDataSubtitle
source: Restore backup from your device.
ta: உங்கள் சாதனத்திலிருந்து நகலெடுக்கப்பட்டதை மீட்டெடுக்கவும்.
te: మీ డివైస్ నుండి బ్యాకప్‌ని రీకవర్ చేయండి.
ur: اپنے آلے سے بیک اپ بحال کریں۔

# restoreDataWarning
source: This process will overwrite the existing data. Are you sure you want to proceed?
ta: இந்த செயல்முறை மூலத் தரவுகளை மீள்மதிப்பீடு செய்யும். தொடர உறுதியாக இருக்கிறீர்களா?
te: ఈ చర్య ప్రస్తుత డేటాను భర్తీ చేస్తుంది. మీరు కొనసాగాలనుకుంటున్నారా?
ur: یہ عمل موجودہ ڈیٹا کو اووررائٹ کر دے گا۔ کیا آپ واقعی جاری رکھنا چاہتے ہیں؟

# backupSuccess
source: Backup Successful
ta: நகலெடுக்கப்பட்டது வெற்றி
te: బ్యాకప్ విజయవంతమైంది
ur: بیک اپ کامیاب

source: Backup Failed
ta: நகலெடுக்கப்பட்டது தோல்வி
te: బ్యాకప్ విఫలమైంది
ur: بیک اپ ناکام

# restoreSuccess
source: Backup Restore Successful
ta: நகலெடுக்கப்பட்டதை மீட்டெடுத்தல் வெற்றி
te: డేటా విజయవంతంగా పునరుద్ధరించబడింది
ur: بیک اپ کامیابی سے بحال ہو گیا

# restoreFailed
source: Backup Restore Failed
ta: நகலெடுக்கப்பட்டதை மீட்டெடுத்தல் தோல்வி
te: డేటా పునరుద్ధరించడంలో విఫలమైంది
ur: بیک اپ بحال کرنے میں ناکامی

# backupInvalidFile
source: Please pick a valid backup file with .db extension.
ta: தயவுசெய்து .db கோப்பு விரிவாக்கத்துடன் செல்லுபடியாகும் நகலெடுக்கப்பட்ட கோப்பைத் தேர்ந்தெடுக்கவும்.
te: దయచేసి సరైన .db ఫైల్‌ను ఎంచుకోండి.
ur: براہ کرم .db ایکسٹینشن والی درست بیک اپ فائل منتخب کریں۔

# deleteDataTitle
source: Delete Data
ta: தரவுகளை அழி
te: డేటాను తొలగించు
ur: ڈیٹا حذف کریں

# deleteDataSubtitle
source: Clear scanned items data.
ta: ஸ்கேன் செய்யப்பட்ட பொருட்களின் தரவுகளை அழி.
te: స్కాన్ చేయబడిన అంశాలను తొలగించు.
ur: اسکین کردہ آئٹمز کا ڈیٹا صاف کریں۔

# deleteDataWarning
source: All history will be permanently removed from the database. This action cannot be undone.
ta: அனைத்து வரலாறும் தரவுத்தளத்திலிருந்து நிரந்தரமாக அழிக்கப்படும். இந்த செயல்முறை மீளமுடியாது.
te: అన్ని చరిత్ర శాశ్వతంగా తొలగించబడుతుంది మరియు తిరిగి పొందలేరు.
ur: تمام تاریخ مستقل طور پر ڈیٹا بیس سے حذف ہو جائے گی۔ یہ عمل واپس نہیں کیا جا سکتا۔

source: About
ta: எங்களைப் பற்றி
te: గురించి
ur: تعارف

# privacyPolicyTitle
source: Privacy Policy
ta: தனியுரிமைக் கொள்கை
te: గోప్యతా విధానం
ur: رازداری کی پالیسی

# privacyPolicySubtitle
source: Click here to read our privacy policy.
ta: எங்கள் தனியுரிமைக் கொள்கையைப் படிக்க இங்கு கிளிக் செய்யவும்.
te: మా గోప్యతా విధానాన్ని చదవడానికి ఇక్కడ ట్యాప్ చేయండి.
ur: ہماری رازداری کی پالیسی پڑھنے کے لیے یہاں کلک کریں۔

# licensesTitle
source: Licenses
ta: உரிமங்கள்
te: లైసెన్సులు
ur: لائسنسز

# licensesSubtitle
source: Click here to view the licenses.
ta: உரிமங்களைப் பார்க்க இங்கு கிளிக் செய்யவும்.
te: లైసెన్సులను చూడటానికి ఇక్కడ ట్యాప్ చేయండి.
ur: لائسنسز دیکھنے کے لیے یہاں کلک کریں۔

# reportBugTitle
source: Bug Report
ta: பிழையை அறிவிக்கவும்
te: బగ్‌ను నివేదించండి
ur: بگ رپورٹ کریں

# reportBugSubtitle
source: Report a bug on github.
ta: GitHub இல் பிழையை அறிவிக்கவும்.
te: GitHub లో బగ్‌ను నివేదించండి.
ur: گِٹ ہب پر بگ رپورٹ کریں۔

# reportBugDialogHeading
source: Report a bug
ta: பிழையை அறிவிக்கவும்
te: బగ్‌ను నివేదించండి
ur: بگ رپورٹ کریں

# reportBugDialogTitle
source: Would you like to report a bug?
ta: பிழையை அறிவிக்க விரும்புகிறீர்களா?
te: మీరు బగ్‌ను నివేదించాలనుకుంటున్నారా?
ur: کیا آپ بگ رپورٹ کرنا چاہتے ہیں؟

# reportBugDialogSubtitle
source: This will open our GitHub issues page where you can describe the problem you encountered.
ta: இது எங்கள் GitHub பிரச்சினைகள் பக்கத்தைத் திறக்கும், அங்கு நீங்கள் எதிர்கொண்ட பிரச்சினையை வ
te: ఇది మిమ్మల్ని GitHub సమస్య పేజీకి తీసుకెళ్తుంది, అక్కడ మీరు వివరాలు ఎంటర్ చేయవచ్చు.
ur: یہ ہمارے گِٹ ہب کے ایشوز پیج کو کھولے گا جہاں آپ مسئلہ بیان کر سکتے ہیں۔

# cameraPermissionRequiredTitle
source: Camera Permission Required
ta: கேமரா அனுமதி தேவை
te: కెమెరా అనుమతి అవసరం
ur: کیمرہ اجازت درکار ہے

# cameraPermissionRequiredSubtitle
source: Camera permission is required to scan QR codes. Please allow access.
ta: QR குறியீடுகளைச் சுட்டி அளவதாக கேமரா அனுமதி தேவை. தயவுசெய்து அணுகலை அனுமதிக்கவும்.
te: QR స్కాన్ చేయడానికి కెమెరా అనుమతి అవసరం. దయచేసి అనుమతి ఇవ్వండి.
ur: کیو آر کوڈ اسکین کرنے کے لیے کیمرہ اجازت ضروری ہے۔ براہ کرم اجازت دیں۔

# cameraPermissionDeniedTitle
source: Camera Permission Permanently Denied
ta: கேமரா அனுமதி நிரந்தரமாக மறுக்கப்பட்டது
te: కెమెరా అనుమతి శాశ్వతంగా నిరాకరించబడింది
ur: کیمرہ اجازت مستقل طور پر مسترد کر دی گئی

# cameraPermissionDeniedSubtitle
source: Camera permission is required to scan QR codes. please allow the permission from the app settings.
ta: QR குறியீடுகளைச் சுட்டி அளவதாக கேமரா அனுமதி தேவை. தயவுசெய்து பயன்பாட்டு அமைப்புகளிலிருந்து அனுமதியை அளிக்கவும்.
te: QR స్కాన్ చేయడానికి కెమెరా అనుమతి అవసరం. దయచేసి యాప్ సెట్టింగ్‌ల్లో అనుమతిని ప్రారంభించండి.
ur: کیو آر کوڈ اسکین کرنے کے لیے کیمرہ اجازت درکار ہے۔ براہ کرم ایپ سیٹنگز سے اجازت دیں۔

source: Open Settings
ta: அமைப்புகளை திறக்கவும்
te: సెట్టింగ్స్ తెరువు
ur: سیٹنگز کھولیں

# openSettingsError
source: Failed to open settings. Please open manually.
ta: அமைப்புகளை திறக்க முடியவில்லை. தயவுசெய்து கையேடு மூலம் திறக்கவும்.
te: సెట్టింగ్స్ తెరువలేకపోయాం. దయచేసి మాన్యువల్గా తెరవండి.
ur: سیٹنگز کھولنے میں ناکامی۔ براہ کرم دستی طور پر کھولیں۔

source: Allow Permission
ta: அனுமதியை வழங்கவும்
te: అనుమతిని ఇవ్వండి
ur: اجازت دیں
